ЛИС2/src/Catalogs/МетодикиОпределенияИзмеренияАнализа/МетодикиОпределенияИзмеренияАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МетодикиОпределенияИзмеренияАнализа</name>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодАнализа</name>
    <type>
      <types>CatalogRef.лис_МетодыАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМетодики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>EnumRef.ПоказателиМетодик</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглениеРезультатовИзмерений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругленияИзмерений</name>
    <type>
      <types>EnumRef.ВариантыОкругленияИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтносительнаяВлажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НапряжениеВСети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НапряжениеВСетиПогрешность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалЕмкости</name>
    <type>
      <types>CatalogRef.МатериалыЕмкости</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемАликвоты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияПробы</name>
    <type>
      <types>CatalogRef.СрокиХраненияПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособКонсервации</name>
    <type>
      <types>CatalogRef.СпособыКонсервации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервацияОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияКонсервированнойПробы</name>
    <type>
      <types>CatalogRef.СрокиХраненияПробы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиФормулы</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДиапазоныИзмерений</name>
    <attributes>
      <name>МетрологическаяХарактеристика</name>
      <type>
        <types>CatalogRef.МетрологическиеХарактеристики</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонИзмеренийОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонИзмеренийДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательПовторяемости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательВоспроизводимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательТочности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательПравильности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Формулы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КачественныеПоказатели</name>
    <attributes>
      <name>МетрологическаяХарактеристика</name>
      <type>
        <types>CatalogRef.МетрологическиеХарактеристики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Enums/ПоказателиМетодик/ПоказателиМетодик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиМетодик</name>
  <enumValues>
    <name>Количественный</name>
  </enumValues>
  <enumValues>
    <name>Качественный</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/МетодикиОпределенияИзмеренияАнализа/Forms/ФормаЭлемента/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьЭлементов()
	
	Если Константы.лис_УправлениеЛабораторией.Получить() = Истина Тогда
		Элементы.МетодАнализа.Видимость 	= Истина;
		Элементы.ОписаниеМетодики.Видимость = Истина;
		Элементы.ПоказателиФормулы.Видимость= Истина;
		Элементы.ГруппаСтраницы.Видимость	= Истина;		
	Иначе
		Элементы.МетодАнализа.Видимость 	= Ложь;
		Элементы.ОписаниеМетодики.Видимость = Ложь;
		Элементы.ПоказателиФормулы.Видимость= Ложь;
		Элементы.ГруппаСтраницы.Видимость	= Ложь;
	КонецЕсли;
	
		
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияКонструктораФормул(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		СтрокаФормулы = Объект.Формулы.Добавить();
		СтрокаФормулы.Формула = Результат;
		//Объект.Формула = Результат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьЭлементов();
	
	Если ЗначениеЗаполнено(Объект.Показатель) Тогда
		Если Объект.Показатель = ПредопределенноеЗначение("Перечисление.ПоказателиМетодик.Количественный") Тогда
			Элементы.СтраницаДиапазоныИзмерений.Видимость = Истина;
		Иначе
			Элементы.СтраницаКачественныеПоказатели.Видимость = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	Диапазоны.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Диапазоны.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиФормулу(Команда)
	
	ПараметрыФормулы = новый СписокЗначений;
	Для каждого ПоказательФормулы из Объект.ПоказателиФормулы Цикл
		ПараметрыФормулы.Добавить(ПоказательФормулы.Показатель, ПоказательФормулы.Описание);
	КонецЦикла;
	
	ПараметрыКонструктораФормул = Новый Структура;
//	ПараметрыКонструктораФормул.Вставить("Формула", Объект.Формула);
	ПараметрыКонструктораФормул.Вставить("ПараметрыФормулы", ПараметрыФормулы);
	
	ВыполнитьПослеЗакрытияКонструктораФормул = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияКонструктораФормул", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.МетодикиОпределенияИзмеренияАнализа.Форма.ФормаКонструктораФормул", ПараметрыКонструктораФормул, ЭтаФорма, , ВариантОткрытияОкна.ОтдельноеОкно, , ВыполнитьПослеЗакрытияКонструктораФормул, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиапазоныИзмеренийФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	Для каждого Строка Из Объект.Формулы Цикл
		ФормулаДляВыбора = Элемент.СписокВыбора.Добавить();
		ФормулаДляВыбора.Значение = Строка.Формула;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Показатель) Тогда
		Если Объект.Показатель = ПредопределенноеЗначение("Перечисление.ПоказателиМетодик.Количественный") Тогда
			Элементы.СтраницаДиапазоныИзмерений.Видимость = Истина;
			Элементы.СтраницаКачественныеПоказатели.Видимость = Ложь;
			Объект.КачественныеПоказатели.Очистить();
		Иначе
			Элементы.СтраницаДиапазоныИзмерений.Видимость = Ложь;
			Элементы.СтраницаКачественныеПоказатели.Видимость = Истина;
			Объект.ДиапазоныИзмерений.Очистить();
		КонецЕсли;
	Иначе
		Элементы.СтраницаДиапазоныИзмерений.Видимость = Ложь;
		Элементы.СтраницаКачественныеПоказатели.Видимость = Ложь;
		Объект.ДиапазоныИзмерений.Очистить();
		Объект.КачественныеПоказатели.Очистить();
	КонецЕсли; 		
	
КонецПроцедуры


#КонецОбласти
